"""
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
my_dict = {"key_1": 500, 2: 400, "key_3": True, 4: None}

# get
print(my_dict.get(2))
"""

month_nomber = input('введите номер месяца')
my_dict = { "1" : 'зима', "2": "зима", "3": "весна", "4": "весна",
            '5':"весна", "6":"лето", "7":"лето","8":"лето","9":"осень",
            "10":"осень","11":"осень","12":"зима"}
print(my_dict.get( month_nomber))
